src/cf/InformationRegisters/SetList.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>SetList</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>SetName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ReleaseDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>SetCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/SetList/Ext/ManagerModule.bsl
Procedure UpdateData() Export
	
	SetListData = MTGJSON.GetMTGData("SetList.json");
		
	For Each Set In SetListData Do
		
		RecordManager = InformationRegisters.SetList.CreateRecordManager();
		RecordManager.SetCode 		= Set.Get("code");
		RecordManager.SetName 		= Set.Get("name");		
		RecordManager.ReleaseDate 	= MTGJSON.GetParameterAs1CDate(Set, "releaseDate");
		
		RecordManager.Write();
	
	EndDo; // Each Set In SetListData
	
EndProcedure
